CMS/TicketingLogs/RequestLog05-07-2021-02-55-55.txt

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <ImportTransIntegration xmlns="urn:microsoft-dynamics-schemas/codeunit/LS_Item_Price">
            <importWebSiteData>
                <Loyaltycustomer xmlns="urn:microsoft-dynamics-nav/xmlports/x50004">
                    <customerEntryno></customerEntryno>
                    <customerNo></customerNo>
                    <customerContactno></customerContactno>
                    <customerMobileno></customerMobileno>
                    <customerLoyaltycustomer></customerLoyaltycustomer>
                    <customerClubcode></customerClubcode>
                    <customerSchemecode></customerSchemecode>
                    <customerName></customerName>
                    <customerName2></customerName2>
                    <customerAddress></customerAddress>
                    <customerAddress2></customerAddress2>
                    <customerCity></customerCity>
                    <customerCountry></customerCountry>
                    <customerPhoneno></customerPhoneno>
                    <customerEmail></customerEmail>
                    <customerPostcode></customerPostcode>
                </Loyaltycustomer>
                <TransactionHeader xmlns="urn:microsoft-dynamics-nav/xmlports/x50004">
                    <headerReceiptNo>WR281027326006</headerReceiptNo>
                    <headerStoreNo>S1001</headerStoreNo>
                    <headerTansactionDate>2021-07-06</headerTansactionDate>
                    <headerTransactionTime>14:55:55</headerTransactionTime>
                    <headerOriginialDate>2021-07-05</headerOriginialDate>
                    <headerNoOfItem>2</headerNoOfItem>
                    <headerNoofItemLines></headerNoofItemLines>
                    <headerMembeCardNo></headerMembeCardNo>
                    <headerCustomerNo></headerCustomerNo>
                    <headerNetAmount>20</headerNetAmount>
                    <headerVATAmount></headerVATAmount>
                    <headerGrossAmount>20</headerGrossAmount>
                    <headerDiscountAmount>1</headerDiscountAmount>
                    <headerTenderType>Online Payment</headerTenderType>
                    <headerPaymentAmount>20</headerPaymentAmount>
					<headerNetPrice>20</headerNetPrice>
                    <TransactionLine>
	<lineReceiptNo>WR281027326006</lineReceiptNo>
	<lineTransDate>2021-07-06</lineTransDate>
	<lineTransTime>14:55:54</lineTransTime>
	<lineNo>10000</lineNo>
	<lineStoreNo>S1001</lineStoreNo>
	<lineTicketNo>60000010</lineTicketNo>
	<lineTicketExpiryDate>2021-07-06</lineTicketExpiryDate>
    <lineTicketActivateDate>2021-07-06</lineTicketActivateDate>
	<lineItemNo>1</lineItemNo>
	<lineItemdescription></lineItemdescription>
	<lineExpirationdate></lineExpirationdate>
	<lineQuantity>1</lineQuantity>
	<lineUnitPrice>10.00</lineUnitPrice>
	<lineVATCode></lineVATCode>
	<lineVATPercentage></lineVATPercentage>
	<lineVatAmount></lineVatAmount>
	<lineNetAmount>20</lineNetAmount>
	<lineDiscountPercent></lineDiscountPercent>
	<lineDiscountAmount>0.5</lineDiscountAmount>
	<lineAmount>20</lineAmount>
</TransactionLine><TransactionLine>
	<lineReceiptNo>WR281027326006</lineReceiptNo>
	<lineTransDate>2021-07-06</lineTransDate>
	<lineTransTime>14:55:54</lineTransTime>
	<lineNo>20000</lineNo>
	<lineStoreNo>S1001</lineStoreNo>
	<lineTicketNo>60000011</lineTicketNo>
	<lineTicketExpiryDate>2021-07-06</lineTicketExpiryDate>
    <lineTicketActivateDate>2021-07-06</lineTicketActivateDate>
	<lineItemNo>2</lineItemNo>
	<lineItemdescription></lineItemdescription>
	<lineExpirationdate></lineExpirationdate>
	<lineQuantity>1</lineQuantity>
	<lineUnitPrice>10.00</lineUnitPrice>
	<lineVATCode></lineVATCode>
	<lineVATPercentage></lineVATPercentage>
	<lineVatAmount></lineVatAmount>
	<lineNetAmount>20</lineNetAmount>
	<lineDiscountPercent></lineDiscountPercent>
	<lineDiscountAmount>0.25</lineDiscountAmount>
	<lineAmount>20</lineAmount>
</TransactionLine>
                </TransactionHeader>
            </importWebSiteData>
        </ImportTransIntegration>
    </Body>
</Envelope>
